MyHome/src/Documents/ВозвратРасходов/ВозвратРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратРасходов</name>
  <basedOn>Document.РегистрацияРасходов</basedOn>
  <registerRecords>AccumulationRegister.ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРасхода</name>
    <type>
      <types>DocumentRef.РегистрацияРасходов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <attributes>
      <name>Кошелек</name>
      <type>
        <types>CatalogRef.КошелькиИСчета</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОперации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРасхода</name>
      <type>
        <types>DocumentRef.РегистрацияРасходов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MyHome/src/Documents/ВозвратРасходов/ObjectModule.bsl
#Область ОбработчикиОбъекта

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;

	Если ЭтоНовый() Тогда
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	ЗаполнитьРеквизитыШапкиПоДаннымТабличнойЧасти();
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Документы.ВозвратРасходов.ИнициализироватьТаблицыДляДвижений(ЭтотОбъект);

	Документы.ВозвратРасходов.ОтразитьДвиженияДенежныхСредств(ЭтотОбъект, Отказ);
	Документы.ВозвратРасходов.ОтразитьДвиженияДоходыРасходы(ЭтотОбъект, Отказ);
	Документы.ВозвратРасходов.ОтразитьДвиженияРасходы(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РегистрацияРасходов") Тогда
		ЗаполнитьПоДокументуРасхода(ДанныеЗаполнения);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыШапкиПоДаннымТабличнойЧасти()
	
	ЭтотОбъект.Сумма = Расходы.Итог("Сумма");
	
	ДокументыРасхода = ЭтотОбъект.Расходы.Выгрузить();
	ДокументыРасхода.Свернуть("ДокументРасхода");
	
	Если ДокументыРасхода.Количество() = 1 Тогда
		ЭтотОбъект.ДокументРасхода = ДокументыРасхода[0].ДокументРасхода;
	Иначе
		ЭтотОбъект.ДокументРасхода = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПоДокументуРасхода(ДокументРасхода)
	
	ТаблицаРасходов = Документы.ВозвратРасходов.ТаблицаРасходовПоДокументамРасхода(ДокументРасхода);
	
	ЭтотОбъект.Расходы.Загрузить(ТаблицаРасходов);
	
КонецПроцедуры

#КонецОбласти
